frontend/performance-tests/artillery/auth-flow-load-test.yml
config:
  target: 'http://localhost:4200'
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    # Ramp up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up"
    # Sustained load phase
    - duration: 120
      arrivalRate: 50
      name: "Sustained load - 50 users"
    # Peak load phase
    - duration: 60
      arrivalRate: 100
      name: "Peak load - 100 users"
    # Stress test phase
    - duration: 30
      arrivalRate: 150
      name: "Stress test - 150 users"
  processor: "./processors/auth-processor.js"
  payload:
    path: "./data/test-users.csv"
    fields:
      - "email"
      - "password"
      - "firstName"
      - "lastName"
      - "phoneNumber"
  defaults:
    headers:
      Accept: "application/json, text/plain, */*"
      Content-Type: "application/json"
      User-Agent: "Artillery/PerformanceTest"
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: "Complete User Registration Flow"
    weight: 30
    flow:
      - get:
          url: "/user/auth"
          name: "Load Auth Page"
          capture:
            - json: "$.csrfToken"
              as: "csrfToken"
        think: 2
      
      - post:
          url: "/api/auth/check-email"
          name: "Check Email Availability"
          json:
            email: "{{ email }}"
          headers:
            X-CSRF-Token: "{{ csrfToken }}"
        think: 1
      
      - post:
          url: "/api/auth/register"
          name: "Submit Registration"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            firstName: "{{ firstName }}"
            lastName: "{{ lastName }}"
            phoneNumber: "{{ phoneNumber }}"
          headers:
            X-CSRF-Token: "{{ csrfToken }}"
        think: 3
      
      - post:
          url: "/api/auth/verify-phone"
          name: "Verify Phone Number"
          json:
            phoneNumber: "{{ phoneNumber }}"
            verificationCode: "123456"
          headers:
            X-CSRF-Token: "{{ csrfToken }}"
        think: 5

  - name: "Existing User Login Flow"
    weight: 50
    flow:
      - get:
          url: "/user/auth"
          name: "Load Auth Page"
          capture:
            - json: "$.csrfToken"
              as: "csrfToken"
        think: 1
      
      - post:
          url: "/api/auth/login"
          name: "Submit Login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          headers:
            X-CSRF-Token: "{{ csrfToken }}"
        think: 2
      
      - post:
          url: "/api/auth/mfa-verify"
          name: "MFA Verification"
          json:
            mfaCode: "123456"
          headers:
            X-CSRF-Token: "{{ csrfToken }}"
        think: 3
      
      - get:
          url: "/user/dashboard"
          name: "Load Dashboard"
        think: 2

  - name: "Password Reset Flow"
    weight: 10
    flow:
      - get:
          url: "/user/auth"
          name: "Load Auth Page"
        think: 1
      
      - post:
          url: "/api/auth/forgot-password"
          name: "Request Password Reset"
          json:
            email: "{{ email }}"
        think: 5

  - name: "Static Asset Loading"
    weight: 10
    flow:
      - get:
          url: "/assets/onredboot-logo.jpg"
          name: "Load Logo Asset"
      - get:
          url: "/favicon.ico"
          name: "Load Favicon"